;-------------------
[System]

; リリースバージョン
; Release Version.
Version=Ver4.12(231107)

; 演奏データの格納されているフォルダへのパス。
; セミコロン(;)で区切ることにより複数のパスを指定できます。（例: d:\DTXFiles1\;e:\DTXFiles2\）
; Pathes for DTX data.
; You can specify many pathes separated with semicolon(;). (e.g. d:\DTXFiles1\;e:\DTXFiles2\)
DTXPath=.\

; プレイヤーネーム。
; 演奏中のネームプレートに表示される名前を設定できます。
; 英字、数字の他、ひらがな、カタカナ、半角カナ、漢字なども入力できます。
; 入力されていない場合は「GUEST」と表示されます。
CardNameDrums=
CardNameGuitar=
CardNameBass=

; グループ名
; 演奏中のネームプレートに表示されるグループ名を設定できます。
; 英字、数字の他、ひらがな、カタカナ、半角カナ、漢字なども入力できます。
; 入力されていない場合は何も表示されません。
GroupNameDrums=
GroupNameGuitar=
GroupNameBass=

; ネームカラー
; 0=白, 1=薄黄色, 2=黄色, 3=緑, 4=青, 5=紫, 6=赤, 7=銅, 8=銀, 9=金, 11～16=各色のグラデーション
NameColorDrums=0
NameColorGuitar=0
NameColorBass=0

; 使用するSkinのフォルダ名。
; 例えば System\Default\Graphics\... などの場合は、SkinPath=.\Default\ を指定します。
; Skin folder path.
; e.g. System\Default\Graphics\... -> Set SkinPath=.\Default\
SkinPath=Default\

; box.defが指定するSkinに自動で切り替えるかどうか (0=切り替えない、1=切り替える)
; Automatically change skin specified in box.def. (0=No 1=Yes)
SkinChangeByBoxDef=1

; 画面モード(0:ウィンドウ, 1:全画面)
; Screen mode. (0:Window, 1:Fullscreen)
FullScreen=0

; ウインドウモード時の画面幅
; A width size in the window mode.
WindowWidth=1280

; ウインドウモード時の画面高さ
; A height size in the window mode.
WindowHeight=720

; ウィンドウモード時の位置X
; X position in the window mode.
WindowX=456

; ウィンドウモード時の位置Y
; Y position in the window mode.
WindowY=226

; ウインドウをダブルクリックした時にフルスクリーンに移行するか(0:移行しない,1:移行する)
; Whether double click to go full screen mode or not.(0:No, 1:Yes)
DoubleClickFullScreen=1

; ALT+SPACEのメニュー表示を抑制するかどうか(0:抑制する 1:抑制しない)
; Whether ALT+SPACE menu would be masked or not.(0=masked 1=not masked)
EnableSystemMenu=1

; 非フォーカス時のsleep値[ms]
; A sleep time[ms] while the window is inactive.
BackSleep=1

; 垂直帰線同期(0:OFF,1:ON)
VSyncWait=1

; フレーム毎のsleep値[ms] (-1でスリープ無し, 0以上で毎フレームスリープ。動画キャプチャ等で活用下さい)
; A sleep time[ms] per frame.
SleepTimePerFrame=-1

; サウンド出力方式(0=ACM(って今はまだDirectSoundですが), 1=ASIO, 2=WASAPI排他, 3=WASAPI共有)
; WASAPIはVista以降のOSで使用可能。推奨方式はWASAPI。
; なお、WASAPIが使用不可ならASIOを、ASIOが使用不可ならACMを使用します。
; Sound device type(0=ACM, 1=ASIO, 2=WASAPI Exclucive, 3=WASAPI Shared)
; WASAPI can use on Vista or later OSs.
; If WASAPI is not available, DTXMania try to use ASIO. If ASIO can't be used, ACM is used.
SoundDeviceType=2

; WASAPI使用時のサウンドバッファサイズ
; (0=デバイスに設定可能な最小値を自動設定, 1～9999=バッファサイズ(単位:ms)の手動指定
; WASAPI Sound Buffer Size.
; (0=set minimum buffer size automaticcaly, 1-9999=specify the buffer size(ms) by yourself)
WASAPIBufferSizeMs=50

; ASIO使用時のサウンドデバイス
; 存在しないデバイスを指定すると、DTXManiaが起動しないことがあります。
; Sound device used by ASIO.
; Don't specify unconnected device, as the DTXMania may not bootup.
; 0: None
ASIODevice=0

; WASAPI/ASIO時に使用する演奏タイマーの種類
; Playback timer used for WASAPI/ASIO
; (0=FDK Timer, 1=System Timer)
SoundTimerType=0

; WASAPI使用時にEventDrivenモードを使う
EventDrivenWASAPI=0

; 全体ボリュームの設定
; (0=無音 ～ 100=最大。WASAPI/ASIO時のみ有効)
; Master volume settings
; (0=Silent - 100=Max)
MasterVolume=100

; ギター/ベース有効(0:OFF,1:ON)
; Enable Guitar/Bass or not.(0:OFF,1:ON)
Guitar=1

; ドラム有効(0:OFF,1:ON)
; Enable Drums or not.(0:OFF,1:ON)
Drums=1

; 背景画像の半透明割合(0:不透明～255:透明)
; Transparency for background image in playing screen.(0:no tranaparent - 255:transparent)
BGAlpha=200

; Missヒット時のゲージ減少割合(0:少, 1:普通, 2:大)
DamageLevel=1

; ゲージゼロでSTAGE FAILED (0:OFF, 1:ON)
StageFailed=1

; LC/HHC/HHO 打ち分けモード (0:LC|HHC|HHO, 1:LC&(HHC|HHO), 2:LC|(HHC&HHO), 3:LC&HHC&HHO)
; LC/HHC/HHO Grouping       (0:LC|HHC|HHO, 1:LC&(HHC|HHO), 2:LC|(HHC&HHO), 3:LC&HHC&HHO)
HHGroup=0

; LT/FT 打ち分けモード (0:LT|FT, 1:LT&FT)
; LT/FT Grouping       (0:LT|FT, 1:LT&FT)
FTGroup=0

; CY/RD 打ち分けモード (0:CY|RD, 1:CY&RD)
; CY/RD Grouping       (0:CY|RD, 1:CY&RD)
CYGroup=0

; LP/LBD/BD 打ち分けモード(0:LP|LBD|BD, 1:LP|(LBD&BD), 2:LP&(LBD|BD), 3:LP&LBD&BD)
; LP/LBD/BD Grouping     (0:LP|LBD|BD, 1:LP(LBD&BD), 2:LP&(LBD|BD), 3:LP&LBD&BD)
BDGroup=0

; 打ち分け時の再生音の優先順位(HHGroup)(0:Chip>Pad, 1:Pad>Chip)
; Grouping sound priority(HHGroup)(0:Chip>Pad, 1:Pad>Chip)
HitSoundPriorityHH=0

; 打ち分け時の再生音の優先順位(FTGroup)(0:Chip>Pad, 1:Pad>Chip)
; Grouping sound priority(FTGroup)(0:Chip>Pad, 1:Pad>Chip)
HitSoundPriorityFT=0

; 打ち分け時の再生音の優先順位(CYGroup)(0:Chip>Pad, 1:Pad>Chip)
; Grouping sound priority(CYGroup)(0:Chip>Pad, 1:Pad>Chip)
HitSoundPriorityCY=0

; シンバルフリーモード(0:OFF, 1:ON)
; Grouping CY and LC (0:OFF, 1:ON)
CymbalFree=0

; AVIの表示(0:OFF, 1:ON)
AVI=1

; 旧サイズのAVI表示を強制的に全画面化する(0:OFF, 1:ON)
; Forcely show BGA-sized movie as Fullscreen.
ForceAVIFullscreen=0

; BGAの表示(0:OFF, 1:ON)
BGA=1

; クリップのウィンドウ表示(0:OFF, 1:ON)
WindowClipDisp=0

; フィルイン効果(0:OFF, 1:ON)
FillInEffect=1

; フィルイン達成時の歓声の再生(0:OFF, 1:ON)
AudienceSound=1

; 曲選択からプレビュー音の再生までのウェイト[ms]
PreviewSoundWait=1000

; Waveの再生位置自動補正(0:OFF, 1:ON)
AdjustWaves=1

; BGM の再生(0:OFF, 1:ON)
BGMSound=1

; ドラム打音の再生(0:OFF, 1:ON)
HitSound=1

; 演奏記録（～.score.ini）の出力 (0:OFF, 1:ON)
SaveScoreIni=1

; RANDOM SELECT で子BOXを検索対象に含める (0:OFF, 1:ON)
RandomFromSubBox=1

; ドラム演奏時にドラム音を強調する (0:OFF, 1:ON)
SoundMonitorDrums=1

; ギター演奏時にギター音を強調する (0:OFF, 1:ON)
SoundMonitorGuitar=1

; ベース演奏時にベース音を強調する (0:OFF, 1:ON)
SoundMonitorBass=1

; ドラムの表示可能な最小コンボ数(1～99999)
MinComboDrums=11

; ギターの表示可能な最小コンボ数(1～99999)
MinComboGuitar=2

; ベースの表示可能な最小コンボ数(1～99999)
MinComboBass=2

; 演奏情報を表示する (0:OFF, 1:ON)
; Showing playing info on the playing screen. (0:OFF, 1:ON)
ShowDebugStatus=0

; 選曲リストのフォント名
; Font name for select song item.
SelectListFontName=MS PGothic

; 選曲リストのフォントのサイズ[dot]
; Font size[dot] for select song item.
SelectListFontSize=20

; 選曲リストのフォントを斜体にする (0:OFF, 1:ON)
; Using italic font style select song list. (0:OFF, 1:ON)
SelectListFontItalic=0

; 選曲リストのフォントを太字にする (0:OFF, 1:ON)
; Using bold font style select song list. (0:OFF, 1:ON)
SelectListFontBold=1

; 打音の音量(0～100%)
; Sound volume (you're playing) (0-100%)
ChipVolume=100

; 自動再生音の音量(0～100%)
; Sound volume (auto playing) (0-100%)
AutoChipVolume=80

; ストイックモード(0:OFF, 1:ON)
; Stoic mode. (0:OFF, 1:ON)
StoicMode=0

; バッファ入力モード(0:OFF, 1:ON)
; Using Buffered input (0:OFF, 1:ON)
BufferedInput=1

; レーン毎の最大同時発音数(1～8)
; Number of polyphonic sounds per lane. (1-8)
PolyphonicSounds=4

; 判定ズレ時間表示(0:OFF, 1:ON, 2=GREAT-POOR)
; Whether displaying the lag times from the just timing or not.
ShowLagTime=0

; 判定・コンボ表示優先度(0:チップの下, 1:チップの上)
; judgement/combo display priority (0:under chips, 1:over chips)
JudgeDispPriority=1

; ドラムのレーン表示位置(0:左側, 1:中央)
; drums lane position (0:LEFT, 1:CENTER)
DrumsLanePosition=0

; リザルト画像自動保存機能(0:OFF, 1:ON)
; Set "1" if you'd like to save result screen image automatically
; when you get hiscore/hiskill.
AutoResultCapture=0

; 再生速度変更を、ピッチ変更で行うかどうか(0:ピッチ変更, 1:タイムストレッチ
; (WASAPI/ASIO使用時のみ有効) 
; Set "0" if you'd like to use pitch shift with PlaySpeed.
; Set "1" for time stretch.
; (Only available when you're using using WASAPI or ASIO)
TimeStretch=0

; 判定タイミング調整(ドラム, ギター, ベース)(-99～99)[ms]
; Revision value to adjust judgement timing for the drums, guitar and bass.
InputAdjustTimeDrums=0
InputAdjustTimeGuitar=0
InputAdjustTimeBass=0

; BGMタイミング調整(-99～99)[ms]
; Revision value to adjust judgement timing for BGM.
BGMAdjustTime=0

; 判定ラインの表示位置調整(ドラム, ギター, ベース)(-99～99)[px]
; Offset value to adjust displaying judgement line for the drums, guitar and bass.
JudgeLinePosOffsetDrums=0
JudgeLinePosOffsetGuitar=0
JudgeLinePosOffsetBass=0
; 判定ラインの表示位置(ギター, ベース)
; 0=Normal, 1=Lower
; Position of the Judgement line and RGB button; Vseries compatible(1) or not(0).
JudgeLinePosModeGuitar=0
JudgeLinePosModeBass=0  

; LC, HH, SD,...の入力切り捨て下限Velocity値(0～127)
; Minimum velocity value for LC, HH, SD, ... to accept.
LCVelocityMin=0
HHVelocityMin=20
SDVelocityMin=0
BDVelocityMin=0
HTVelocityMin=0
LTVelocityMin=0
FTVelocityMin=0
CYVelocityMin=0
RDVelocityMin=0
LPVelocityMin=0
LBDVelocityMin=0

;-------------------
[Log]

; Log出力(0:OFF, 1:ON)
OutputLog=1

; 曲データ検索に関するLog出力(0:OFF, 1:ON)
TraceSongSearch=0

; 画像やサウンドの作成・解放に関するLog出力(0:OFF, 1:ON)
TraceCreatedDisposed=0

; DTX読み込み詳細に関するLog出力(0:OFF, 1:ON)
TraceDTXDetails=0

;-------------------
[PlayOption]

; DARKモード(0:OFF, 1:HALF, 2:FULL)
Dark=0

; ドラムSUDDENモード(0:OFF, 1:ON)
DrumsSudden=0

; ギターSUDDENモード(0:OFF, 1:ON)
GuitarSudden=0

; ベースSUDDENモード(0:OFF, 1:ON)
BassSudden=0

; ドラムHIDDENモード(0:OFF, 1:ON)
DrumsHidden=0

; ギターHIDDENモード(0:OFF, 1:ON)
GuitarHidden=0

; ベースHIDDENモード(0:OFF, 1:ON)
BassHidden=0

; ドラムチップ非表示モード (0:OFF, 1=SEMI, 2:FULL)
; Drums chip invisible mode
DrumsInvisible=0

; ギターチップ非表示モード (0:OFF, 1=SEMI, 2:FULL)
; Guitar chip invisible mode
GuitarInvisible=0

; ベースチップ非表示モード (0:OFF, 1=SEMI, 2:FULL)
; Bbass chip invisible mode
BassInvisible=0

; ドラムREVERSEモード(0:OFF, 1:ON)
DrumsReverse=0

; ギターREVERSEモード(0:OFF, 1:ON)
GuitarReverse=0

; ベースREVERSEモード(0:OFF, 1:ON)
BassReverse=0

; ギターRANDOMモード(0:OFF, 1:Random, 2:SuperRandom, 3:HyperRandom)
GuitarRandom=0

; ベースRANDOMモード(0:OFF, 1:Random, 2:SuperRandom, 3:HyperRandom)
BassRandom=0

; ギターLIGHTモード(0:OFF, 1:ON)
GuitarLight=0

; ベースLIGHTモード(0:OFF, 1:ON)
BassLight=0

; ギターLEFTモード(0:OFF, 1:ON)
GuitarLeft=0

; ベースLEFTモード(0:OFF, 1:ON)
BassLeft=0

; RISKYモード(0:OFF, 1-10)
; RISKY mode. 0=OFF, 1-10 is the times of misses to be Failed.
Risky=0

; TIGHTモード(0:OFF, 1:ON)
; TIGHT mode. 0=OFF, 1=ON 
DrumsTight=0

; ドラム判定文字表示位置(0:表示OFF, 1:レーン上, 2:判定ライン上)
; Drums Judgement display position (0:OFF, 1:on the lane, 2:over the judge line)
DrumsPosition=1

; ギター判定文字表示位置(0:表示IFF, 1:レーン上, 2:判定ライン上, 3:コンボ下)
; Guitar Judgement display position (0:OFF, 1:on the lane, 2:over the judge line, 3:under combo)
GuitarPosition=1

; ベース判定文字表示位置(0:表示OFF, 1:レーン上, 2:判定ライン上, 3:コンボ下)
; Bass Judgement display position (0:OFF, 1:on the lane, 2:over the judge line, 3:under combo)
BassPosition=1

; ドラム譜面スクロール速度(0:x0.5, 1:x1.0, 2:x1.5,…,1999:x1000.0)
DrumsScrollSpeed=1

; ギター譜面スクロール速度(0:x0.5, 1:x1.0, 2:x1.5,…,1999:x1000.0)
GuitarScrollSpeed=1

; ベース譜面スクロール速度(0:x0.5, 1:x1.0, 2:x1.5,…,1999:x1000.0)
BassScrollSpeed=1

; 演奏速度(5～40)(→x5/20～x40/20)
PlaySpeed=20

; ドラムCOMBO文字表示位置(0:左, 1:中, 2:右, 3:OFF)
ComboPosition=0

; グラフ表示(0:OFF, 1:ON)
DrumGraph=0
GuitarGraph=0
BassGraph=0

; AUTOゴースト種別 (0:PERFECT, 1:LAST_PLAY, 2:HI_SKILL, 3:HI_SCORE, 4:ONLINE)
DrumAutoGhost=0
GuitarAutoGhost=0
BassAutoGhost=0

; ターゲットゴースト種別 (0:NONE, 1:PERFECT, 2:LAST_PLAY, 3:HI_SKILL, 4:HI_SCORE, 5:ONLINE)
DrumTargetGhost=0
GuitarTargetGhost=0
BassTargetGhost=0

; 譜面仕様変更(0:デフォルト10レーン, 1:XG9レーン, 2:CLASSIC6レーン)
NumOfLanes=0

; dkdk仕様変更(0:デフォルト, 1:始動足変更, 2:dkdk1レーン化)
DkdkType=0

; バスをLBDに振り分け(0:OFF, 1:ON)
AssignToLBD=0

; ドラムパッドRANDOMモード(0:OFF, 1:Mirror, 2:Random, 3:SuperRandom, 4:HyperRandom, 5:MasterRandom, 6:AnotherRandom)
DrumsRandomPad=0

; ドラム足RANDOMモード(0:OFF, 1:Mirror, 2:Random, 3:SuperRandom, 4:HyperRandom, 5:MasterRandom, 6:AnotherRandom)
DrumsRandomPedal=0

; ライドシンバルレーンの表示位置(0:...RD RC, 1:...RC RD)
RDPosition=1

; ネームプレートタイプ
; 0:タイプA XG2風の表示がされます。
; 1:タイプB XG風の表示がされます。このタイプでは7_NamePlate_XG.png、7_Difficlty_XG.pngが読み込まれます。
NamePlateType=1

; XPerfect判定を有効にする(0:OFF, 1:ON)
XPerfectJudgeMode=0

; シャッターINSIDE(0～100)
DrumsShutterIn=0
GuitarShutterIn=0
BassShutterIn=0

; シャッターOUTSIDE(0～100)
DrumsShutterOut=0
GuitarShutterOut=0
BassShutterOut=0

; ドラムレーンタイプ(0:A, 1:B, 2:C, 3:D )
DrumsLaneType=0

; CLASSIC譜面判別
CLASSIC=1

; スキルモード(0:旧仕様, 1:XG仕様)
SkillMode=0

; スキルモードの自動切換え(0:OFF, 1:ON)
SwitchSkillMode=1

; レーン表示
; 0:ALL ON レーン背景、小節線を表示します。
; 1:LANE FF レーン背景を消します。
; 2:LINE OFF 小節線を消します。
; 3:ALL OFF すべて消します。
DrumsLaneDisp=0
GuitarLaneDisp=0
BassLaneDisp=0

; 判定ライン表示
DrumsJudgeLineDisp=1
GuitarJudgeLineDisp=1
BassJudgeLineDisp=1

; レーンフラッシュ表示
DrumsLaneFlush=1
GuitarLaneFlush=1
BassLaneFlush=1

; 判定画像のアニメーション方式
;(0:旧DTXMania方式 1:コマ方式 2:擬似XG方式)
JudgeAnimeType=2

; 判定数の表示(0:表示しない, 1:表示する)
JudgeCountDisp=0

; JUST
DrumsJust=0
GuitarJust=0
BassJust=0

; シャッター画像
ShutterImageDrums=
ShutterImageGuitar=
ShutterImageBass=

; フレームの表示(0:表示しない, 1:表示する)
MatixxFrameDisp=1
;-------------------
[ViewerOption]

; Viewerモード時専用 ドラム譜面スクロール速度(0:x0.5, 1:x1.0, 2:x1.5,…,1999:x1000.0)
; for viewer mode; Drums Scroll Speed
ViewerDrumsScrollSpeed=1

; Viewerモード時専用 ギター譜面スクロール速度(0:x0.5, 1:x1.0, 2:x1.5,…,1999:x1000.0)
; for viewer mode; Guitar Scroll Speed
ViewerGuitarScrollSpeed=1

; Viewerモード時専用 ベース譜面スクロール速度(0:x0.5, 1:x1.0, 2:x1.5,…,1999:x1000.0)
; for viewer mode; Bass Scroll Speed
ViewerBassScrollSpeed=1

; Viewerモード時専用 垂直帰線同期(0:OFF,1:ON)
; for viewer mode; Use whether Vertical Sync or not.
ViewerVSyncWait=1

; Viewerモード時専用 演奏情報を表示する (0:OFF, 1:ON) 
; for viewer mode;
; Showing playing info on the playing screen. (0:OFF, 1:ON) 
ViewerShowDebugStatus=1

; Viewerモード時専用 再生速度変更を、ピッチ変更で行うかどうか(0:ピッチ変更, 1:タイムストレッチ 
; (WASAPI/ASIO使用時のみ有効)  
; for viewer mode;
; Set "0" if you'd like to use pitch shift with PlaySpeed. 
; Set "1" for time stretch. 
; (Only available when you're using using WASAPI or ASIO) 
ViewerTimeStretch=0

; Viewerモード時専用 ギター/ベース有効(0:OFF,1:ON) 
; for viewer mode;
; Enable Guitar/Bass or not.(0:OFF,1:ON) 
ViewerGuitar=1

; Viewerモード時専用 ドラム有効(0:OFF,1:ON) 
; for viewer mode;
; Enable Drums or not.(0:OFF,1:ON) 
ViewerDrums=1

; Viewerモード専用 ウインドウモード時の画面幅
; A width size in the window mode, for viewer mode.
ViewerWindowWidth=640

; Viewerモード専用 ウインドウモード時の画面高さ
; A height size in the window mode, for viewer mode.
ViewerWindowHeight=360

; Viewerモード専用 ウィンドウモード時の位置X
; X position in the window mode, for viewer mode.
ViewerWindowX=0

; Viewerモード専用 ウィンドウモード時の位置Y
; Y position in the window mode, for viewer mode.
ViewerWindowY=0

;-------------------
[AutoPlay]

; 自動演奏(0:OFF, 1:ON)

; Drums
LC=0
HH=0
SD=0
BD=0
HT=0
LT=0
FT=0
CY=0
LP=0
LBD=0

; Guitar
GuitarR=1
GuitarG=1
GuitarB=1
GuitarPick=1
GuitarWailing=1

; Bass
BassR=1
BassG=1
BassB=1
BassPick=1
BassWailing=1

;-------------------
[HitRange]

; Perfect～Poor とみなされる範囲[ms]
Perfect=34
Great=67
Good=84
Poor=117

; ペダルレーンの判定補正値[ms]
; 各判定のヒット範囲に加算されます。0～200msで指定できます。(暫定仕様)
PedalJudgeRangeDelta=20
;-------------------
[GUID]


;-------------------
; キーアサイン
;   項　目：Keyboard → 'K'＋'0'＋キーコード(10進数)
;           Mouse    → 'N'＋'0'＋ボタン番号(0～7)
;           MIDI In  → 'M'＋デバイス番号1桁(0～9,A～Z)＋ノート番号(10進数)
;           Joystick → 'J'＋デバイス番号1桁(0～9,A～Z)＋ 0 ...... Ｘ減少(左)ボタン
;                                                         1 ...... Ｘ増加(右)ボタン
;                                                         2 ...... Ｙ減少(上)ボタン
;                                                         3 ...... Ｙ増加(下)ボタン
;                                                         4 ...... Ｚ減少(前)ボタン
;                                                         5 ...... Ｚ増加(後)ボタン
;                                                         6～133.. ボタン1～128
;           これらの項目を 16 個まで指定可能(',' で区切って記述）。
;
;   表記例：HH=K044,M042,J16
;           → HiHat を Keyboard の 44 ('Z'), MidiIn#0 の 42, JoyPad#1 の 6(ボタン1) に割当て
;
;   ※Joystick のデバイス番号とデバイスとの関係は [GUID] セクションに記してあるものが有効。
;

[DrumsKeyAssign]

HH=K035,M042,M093
SD=K033,M025,M026,M027,M028,M029,M031,M032,M034,M037,M038,M040,M0113
BD=K012,K0126,M033,M035,M036,M0112
HT=K031,M048,M050
LT=K011,M047
FT=K023,M041,M043,M045
CY=K022,M049,M052,M055,M057,M091
HO=K010,M046,M092
RD=K020,M051,M053,M059,M089
LC=K026
LP=
LBD=

[GuitarKeyAssign]

R=K055
G=K056,J012
B=K057
Pick=K0115,K046,J06
Wail=K0116
Decide=K060
Cancel=K061

[BassKeyAssign]

R=K090
G=K091,J013
B=K092
Pick=K0103,K0100,J08
Wail=K089
Decide=K096
Cancel=K097

[SystemKeyAssign]

Capture=K065

[Temp]

;-------------------
